src/InformationRegisters/ПочтовыеСообщенияВходящие/ПочтовыеСообщенияВходящие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПочтовыеСообщенияВходящие</name>
  <resources>
    <name>Обработано</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СообщениеОбОшибке</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПочтовоеСообщение</name>
    <type>
      <types>DocumentRef.ПочтовоеСообщение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПочтовыеСообщенияВходящие/ManagerModule.bsl
//////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ЗарегистрироватьСообщение(ПочтовоеСообщение) Экспорт
	Запись 						= РегистрыСведений.ПочтовыеСообщенияВходящие.СоздатьМенеджерЗаписи();
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Записать();
КонецПроцедуры // ЗарегистрироватьСообщение

Процедура УстановитьОтметкуОбработки(ПочтовоеСообщение, СообщениеОбОшибке = Неопределено) Экспорт
	Запись 						= РегистрыСведений.ПочтовыеСообщенияВходящие.СоздатьМенеджерЗаписи();
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Прочитать();
	Если Запись.Выбран() Тогда
		Если СообщениеОбОшибке = Неопределено Тогда
			Запись.Обработано 			= Истина;
			Запись.СообщениеОбОшибке 	= "";
		Иначе
			Запись.Обработано 			= Ложь;
			Запись.СообщениеОбОшибке 	= СообщениеОбОшибке;
			Запись.КоличествоПопыток	= Запись.КоличествоПопыток + 1;
		КонецЕсли; // Если СообщениеОбОшибке = Неопределено Тогда
		Запись.Записать();
	КонецЕсли; // Если Запись.Выбран() Тогда   	
КонецПроцедуры // УстановитьОтметкуОбработки
